package com.example.mente.Data.QuestionsSpecialist.neuralScreening

import com.example.mente.Models.Question

class DataQuestion{

companion object{


    var neuralDataList1 = mutableListOf<Question>(
        Question(1,"(1) يمسك القلم بطريقة غير متقنة ، متوترة" ,1),
        Question(2,"(2) يكتب بحروف غير متصلة( لمن هم فوق الثامنة )" ,1),
        Question(3," (3) يقرب عينيه من الورقة أثناء الكتابة " ,1),
        Question(4," (4) يرتعش بوضوح اثناء الكتابة " ,3),

    )


    var neuralDataList2 = mutableListOf<Question>(
        Question(1,"(1) يتعرف على اقل من خمس اشكال" ,1),
        Question(2,"(2) يرسم الاشكال بطريقة افقية" ,1),
        Question(3,"(3) يرسم الاشكال ببطء شديد أو بسرعة كبيرة" ,1),
        Question(4,"(4) يرسم الاشكال كبيرة جداً ، صغيرة جداً ، أو بطريقة شاذة" ,1),
        Question(5,"(5) يدير الورقة أثناء الرسم" ,1),
        Question(6,"(6) يرسم الاشكال مائلة إلى اليمين ، أو إلى اليسار" ,1),
        Question(7,"(7) يتمم إلى نفسه اثناء الرسم" ,1),
        Question(8,"(8) يرسم الاشكال ناقصة (اغلاق غير جيد)" ,1),
        Question(9,"(9) يرسم الزوايا بطريقة خاطئة" ,3),
        Question(10,"(10) يرتعش بوضوح أثناء الرسم" ,3),
    )

    var neuralDataList3 = mutableListOf<Question>(
        Question(1,"(1) الاستجابة بالحروف بدالً من االرقام" ,1),
        Question(2,"(2) اليد اليمنى 3 (أ)" ,1),
        Question(3,"(3)   9 (ق)" ,1),
        Question(4,"(4)  5 (ة)" ,1),
        Question(5,"(5) 7(ن)" ,1),
        Question(6,"(6) اليد اليسرى 2(ك) " ,1),
        Question(7,"(7) 8(ل)" ,1),
        Question(8,"(8) 4(ع)" ,1),
        Question(9,"(9) 6(د)" ,1)
    )

    var neuralDataList4 = mutableListOf<Question>(
        Question(1,"يحرك رأسه أثناء المتابعة البصرية",1),
        Question(2,"يهتز اهتزازاً تشنجياً(أفقياً)",1),
        Question(3,"يهتز اهتزازاً تشنجياً(رأسياً)،وعدم تآزر",3),
        Question(4,"يتشتت انتباهه أثناء الأداء",3)
    )


    var neuralDataList5 = mutableListOf<Question>(
        Question(1," (1) ينجح فى محاكاه نمط ايقاعى واحد فقط (حركى / لفظى)" ,1),
        Question(2," (2) يخطئ فى محاكاه احد الانماط التتابعية" ,1),
        Question(3," (3)  يبدل الايدى ، يستخدم يد واحدة ، يصفق بيديه" ,1),
        Question(4,"(4) لا ينجح فى المحاكاه الا حين يقدم إليه النمط بصوت عالى جدا" ,1),
        Question(5,"(5) يبدل فى محاكاه األنماط الصوتية (1-2-3) بدلا من (1-3-2)" ,1),
        Question(6," (6) يظهر جوانب شذوذ فى الكالم (مثل التلعثم)" ,1),
        Question(7," (7) يستمر فى المحاكاه (ال يعرف متى يتوقف)" ,3),
        Question(8," (8) يخطئ فى المحاكاه اللفظية (نمطين او اكثر)" ,3),
        Question(9," (9) يخطئ فى المحاكاه الحركية (نمطين او اكثر)" ,3),

                   )



    var neuralDataList6 = mutableListOf<Question>(
        Question(1," (1) ﻻ ﯾﻣﯾز ﺑوﺿوح ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر ( ﻻ ﺗﻌطﻰ درﺟﺔ و ﺗﺳﺟل ﻓﻰ اﻻﺧﺗﺑﺎر ١٤)" ,0),
        Question(2," (2) ﯾؤدى اﻟﻣﮭﻣﺔ ﺑﺳرﻋﺔ أو ﺑﺑطء ﻋﺎدٍة " ,1),
        Question(3," (3)  يحرك اليد بانتظام نحو يمين أو يسار الهدف فى الفراغ (أنفه )" ,1),
        Question(4," (4)  يحرك اليد بانتظام إلى أعلى أو أسفل الهدف فى الفراغ (أنفه )" ,1),
        Question(5,"(5) ﯾﻠﻣس ﻣﻛﺎﻧﺎً ﺑﻌﯾداً ﻋن طرف أﻧﻔﮫ (ﺑﻧﺻف ﺑوﺻﺔ أو ﺑوﺻﺔ)" ,1),
        Question(6," (6) ﯾﻠﻣس ﻣﻛﺎﻧﺎً ﺑﻌﯾداً ﻋن طرف أﻧﻔﮫ ﺑﺄﻛﺛر ﻣن ﺑوﺻﺔ  (ﻻﺣظ إذاﻛﺎن اﻟﻠﻣس ﻓﻰ ﻣﻛﺎن ﺑﻌﯾد داﺋﻣﺎ)" ,3),
        Question(7," (7) ﻻ ﯾﺳﺗطﯾﻊ اﻟﺳﯾطرة اﻻرادﯾﺔ ﻋﻠﻰ ﺣرﻛﺔ اﻟذاﻋﯾن" ,3),

                   )

    var neuralDataList7 = mutableListOf<Question>(
        Question(1," (1) ﻻ ﯾﺳﺗطﯾﻊ اﻟﺗﻣﯾﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر  (  ﺗﻌطﻰ درﺟﺔ و ﺗﺳﺟل ﻓﻰ اﻻﺧﺗﺑﺎر ١٤)" ,0),
        Question(2," (2) ﯾﻛون اﻟدواﺋر ﺑطرﯾﻘﺔ ﻋﻛﺳﯾﺔ (ﯾﺑدأ ﻣن اﻹﺻﺑﻊ اﻟﺻﻐﯾر و ﯾﻧﺗﮭﻰ ﺑﺎﻟﺳﺑﺎﺑﺔ) " ,1),
        Question(3," (3)  ﯾﺣرك أﺻﺎﺑﻊ ﯾده اﻷﺧرى ﺣرﻛﺔ ﺑﺳﯾطﺔ أﺛﻧﺎء اﻷداء" ,1),
        Question(4," (4)  ﯾﻛون دواﺋر ﻣﻔرطﺣﺔ أو ﺻﻐﯾرة ﺟداً ، أو ﻏﯾر ﻛﺎﻣﻠﺔ" ,1),
        Question(5,"(5) ﯾرﻓﻊ ﯾده أﻣﺎﻣﮫ أو ﯾرﻛز ﻋﻠﯾﮭﺎ - ﺑﻘﺻد - أﺛﻧﺎء اﻷداء" ,1),
        Question(6," (6) ﯾﺣرك ﺟﺳﻣﮫ ﻛﻠﮫ - أو اﻟﺟﺎﻧب اﻵﺧر ﻣﻧﮫ - ﺣرﻛﺔ ﻋﺷواﺋﯾﺔ" ,3),
        Question(7," (7) ﯾرﺗﺑك ﻓﻰ ﺗﺣدﯾد اﻹﺻﺑﻊ اﻟﺗﺎﻟﯾﺔ ﻓﻰ ﺗﻛوﯾن اﻟدواﺋر ، أو ﯾﺗﺧطﻰ إﺻﺑﻌﺎً" ,3),


                   )


    var neuralDataList8 = mutableListOf<Question>(
        Question(1," (1) ﯾﮭﺗز ﻻ إرادﯾﺎ ﺣﯾن ﯾﺣس ﺑﻠﻣﺳﺔ ﻋﻠﻰ ﺧده" ,1),
        Question(2," (2) ﻻ ﯾﺷﻌر أﺣﯾﺎﻧﺎً ﺑﺎﻟﻠﻣﺳﺔ ﻋﻠﻰ ﯾده " ,1),
        Question(3," (3)  ﻻ ﯾﺷﻌر ﺑﻠﻣﺳﺔ اﻟﯾد ﻋﻠﻰ ﻛﻼ اﻟﺟﺎﻧﺑﯾن  (ظﺎھرة ﻋﺎدﯾﺔ ﻟدى اﻗل ﻣن ٦ ﺳﻧوات )" ,3),
        Question(4," (4)  ﻻ ﯾﺷﻌر داﺋﻣﺎً ﺑﻠﻣﺳﺔ اﻟﯾظ ﻋﻠﻰ ﺟﺎﻧب واﺣد ﻣن اﻟﺟﺳم" ,3),
        Question(5,"(5) ﯾﺧطﺊ ﻓﻰ اﻹدراك اﻟﺣﺳﻲ  (ﻣﺛﺎل : ﺗﺳﻣﯾﺔ ﺧﺎطﺋﺔ ﻟﻣﻛﺎن اﻟﻠﻣس)" ,3),

        )

    var neuralDataList9 = mutableListOf<Question>(
        Question(1," (1) ﯾﺗﺧﺑط ﻓﻰ ﺗﻘﻠﯾب اﻟﯾدﯾن أو ﻓﻰ ﺗﺣرﯾك اﻷﺻﺎﺑﻊ" ,1),
        Question(2," (2) ﯾﻘﻠب ﯾدﯾﮫ ﺑﻣﻌدل ﺳرﯾﻊ أو ﺑطﺊ  " ,1),
        Question(3," (3)  ﺗرﺗد اﻟﯾدان ﺑﺳرﻋﺔ ﻓﺟﺎﺋﯾﺔ ، أو ﺗﻛون اﻷﺻﺎﺑﻊ ﻓﻰ وﺿﻊ ﻣﺗﺻﻠب" ,1),
        Question(4,"(4) ﯾﻘﻠب ﯾدﯾﮫ ﻓﻰ ﺣرﻛﺎت داﺋرﯾﺔ ﻛﺑﯾرة  (ﻗدرھﺎ ﻗدم واﺣدة)" ,3),
        Question(5,"(5) ﯾﻘﻠب ﯾدﯾﮫ ﺑﺷﻛل ﻏﯾر ﻣﺗﺳق   (ﺗﺧﺗﻠف إﺣدى اﻟﯾدﯾن ﻋن اﻷﺧرى)" ,3),

        )

    var neuralDataList10 = mutableListOf<Question>(
        Question(1," (1) ﯾﺣرك ﺟﺳﻣﮫ ، أو ﯾده ، أو ﻟﺳﺎﻧﮫ ﺣرﻛﺔ ﻋﺷواﺋﯾﺔ " ,3),
        Question(2," (2) ﯾظﮭر ﺗوﺗراً ﻋﺿﻠﯾﺎً ﺷدﯾداً (ﻻﺣظ ﻓرط أو ھﺑوك اﻹﯾﻘﺎع اﻟﺣرﻛﻰ) " ,3),
        Question(3," (3) ﻻ ﯾﺳﺗطﯾﻊ إﺗﺧﺎذ اﻟوﺿﻊ اﻟﻣطﻠوب (ﺗﺗﺣرك اﻷطراف إﻟﻰ اﺳﻔل ﻻ إرادﯾﺎً)" ,3),
        Question(4,"(4) ﻻ ﯾﺳﺗطﯾﻊ إﺗﺧﺎذ اﻟوﺿﻊ اﻟﻣطﻠوب (ﯾﺗﺣرك اﻟﺟﺳم ﻛﻠﮫ إﻟﻰ اﻷﻣﺎم ﻻ إرادﯾﺎً)" ,3),
        Question(5,"(5) ﯾﻔرد اﻷﺻﺎﺑﻊ ﺑطرﯾﻘﺔ ﺷﺎذة (ﻣﺛﺎل : ﯾﺛﻧﻰ أطراف اﺻﺎﺑﻌﮫ ﺑﺣﯾث ﺗﺑدو ﻛﺎﻟﻣﺧﺎﻟب)" ,3),
        Question(6,"(6) ﺗﻧﺧﻔض اﻷﯾدى اﻟﻣﻔرودة إﻟﻰ أﺳﻔل اﻟﻣﻌﺻم" ,3),
        Question(7,"(7) ﺗرﺗﻌش أو ﺗﮭﺗز اﻟﯾدان أو اﻟرﺟﻼن ﺑﺷﻛل ﻣﻠﺣوظ " ,3),

        )

    var neuralDataList11 = mutableListOf<Question>(
        Question(1," (1) ﯾﻌﺎﻧﻰ ﺻﻌوﺑﺔ ﻓﻲ اﻟﻣﺷﻰ اﻟﺗﺑﺎدﻟﻰ ﻟﻠوراء " ,1),
        Question(2," (2) ﯾﻌﺎﻧﻰ ﺻﻌوﺑﺔ ﻓﻰ اﻟﻣﺷﻰ اﻟﺗﺑﺎدﻟﻰ و اﻟﻌﯾﻧﺎن ﻣﻐﻣﺿﺗﺎن " ,1),
        Question(3," (3) ﺗﺗﺣرك إﺣدى اﻟﯾدﯾن طوﻟﯾﺎً ﻟﻠداﺧل و ﺗﺗﺣرك اﻻﺧرى ﻟﻠﺧﺎرج" ,1),
        Question(4,"(4) ﯾﻣﯾل أﺛﻧﺎء اﻟﻣﺷﻲ إﻟﻰ اﻟﯾﺳﺎر أو إﻟﻰ اﻟﯾﻣﯾن " ,1),
        Question(5,"(5) ﺧطواﺗﮫ واﺳﻌﺔ ، أو ﻣﺗداﺧﻠﺔ ﺿﯾﻘﺔ  " ,1),
        Question(6,"(6) اﻟرﻛﺑﺗﺎن ﻣﻧﺣﻧﯾﺗﺎن اﺛﻧﺎء اﻟﻣﺷﻰ" ,3),
        Question(7,"(7) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗواﻧﮫ (ﻻﺣظ ﺗﻣوج ﺣرﻛﺔ اﻟذراﻋﯾن) " ,3),
        Question(8,"(8) ﯾﺗﺣرك ﺟﺳﻣﮫ ﻋﺷواﺋﯾﺎً (ﻻﺣظ ھل اﻟﺣرﻛﺔ ﻓﻰ اﻟذراﻋﯾن أﻛﺛر أم اﻟرﺟﻠﯾن) " ,3),

        )

    var neuralDataList12 = mutableListOf<Question>(
        Question(1," (1) ﻻ ﯾﺳﺗطﯾﻊ اﻟﺗﻣﯾﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎ " ,1),
        Question(2," (2) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗوازﻧﮫ أﺛﻧﺎء اﻟوﻗوف " ,1),
        Question(3," (3) ﻻ ﯾﺳﺗطﯾﻊ اﻟوﻗوف و اﻟﻌﯾﻧﺎن ﻣﻐﻣﺿﺗﺎن" ,1),
        Question(4,"(4) ﯾﺻﻌب ﻋﻠﮫ اﻟوﻗوف ﻋﻠﻰ اﻟرﺟل اﻟﯾﻣﻧﻰ / اﻟﯾﺳرى  " ,1),
        Question(5,"(5) ﯾﻠﺗوى ﺟﺳﻣﮫ إﻟﺗواء ﺷدﯾداً أﺛﻧﺎء اﻟوﻗوف  " ,1),


        )

   var neuralDataList13 = mutableListOf<Question>(
        Question(1," (1) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗوازﻧﮫ أﺛﻧﺎء اﻟﺣﺟل " ,1),
        Question(2," (2) ﻻ ﯾﻣﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر (ﺗﻼﺣظ أﯾﺿﺎً ﻓﻲ اﻻﺧﺗﺑﺎر ١٥) " ,1),
        Question(3," (3) ﯾﺳﺗطﯾﻊ اﻟوﺛب ﻋﻠﻰ رﺟل واﺣدة ﻓﻘط (اﻟﯾﻣﻧﻰ أو اﻟﯾﺳرى)" ,1),
        Question(4,"(4) ﻻ ﯾﺳﺗطﯾﻊ اﻟوﺛب ﻋﻠﻰ أى ﻣن اﻟرﺟﻠﯾن (ﺑﻌد اﻟﺳﺎدﺳﺔ ﻟﻠﺑﻧﺎت و ﺑﻌد اﻟﺛﺎﻣﻧﺔ ﻟﻸوﻻد)  " ,3),

        )

   var neuralDataList14 = mutableListOf<Question>(
        Question(1," (1) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ ٦) " ,1),
        Question(2," (2) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ ٧) " ,1),
        Question(3," (3) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ١٢   )" ,1),


        )

    var neuralDataList15 = mutableListOf<Question>(
        Question(1," (1) ﯾﺻدر اﻧﻣﺎط ﺳﻠوﻛﯾﺔ ﺷﺎذة ( ﻛﺎﻟﻐﺑث ﺑﺎﻟﺷﻌر ، و اﻟﮭرش)… " ,1),
        Question(2," (2) ﯾﻛرر اﻟﺳﻠوك ﺑطرﯾﻘﺔ ﻗﮭرﯾﺔ (اﻟﻣﻌﺎودة) " ,1),
        Question(3," (3) ﯾﻔرط ﻓﻲ اﻟﻛﻼم اﻟﻐﯾر اﻟواﺿﺢ (اﻟﻣﺑﮭم) أﺛﻧﺎء اﻷداء" ,1),
        Question(4,"(4) ھﺎدئ ﺑﺷﻛل ﻏﯾر ﻣﻌﺗﺎد ﻣﻊ ظﮭور أﻋراض ﺳﻠوﻛﯾﺔ اﻧﺳﺣﺎﺑﯾﺔ " ,1),
        Question(5,"(5) ﯾظﮭر ﻗﻠﻘﺎً ﻣﺻﺣوﺑﺎً ﺑﺣرﻛﺎت ﻋﺻﺑﯾﺔ ) اﻟﺗﻣﻠﻣل - اﻻﻓراط ﻓﻰ اﻟﺳﻠوك اﻟﻠﻣﺳﻰ أو اﻟﺣرﻛﻰ)  " ,1),
        Question(6,"(6) ﯾﺑرر ﻣﺳﺗوى اداﺋﮫ ﺑﺷﻛل دﻓﺎﻋﻰ" ,1),
        Question(7,"(7) ﻗﺎﺑل ﻟﻼﺳﺗﺛﺎرة ، أو ﺷرود اﻟذھن ، أو اﻻﻧدﻓﺎﻋﯾﺔ  " ,1),

        )


}


}