package com.example.mente.Data.QuestionsSpecialist.FathyElZayat

import com.example.mente.Models.Question

class DataFathyElZayat {

    companion object{


    var fathyElZayatDataList1 = mutableListOf<Question>(
        Question(1," (1) يصعب عليه الاستمرار في أي عمل حتى يتمه" ,0),
        Question(2," (2) يبدو شارداً أو مشتتًا أو غير منتبه لما يسمع أو يقرأ أو يرى. " ,0),
        Question(3," (3)  يسهل تشتيته، يتشتت انتباهه بسهولة لأي مثيرات" ,0),
        Question(4," (4)  يجد صعوبة في أن يظل محتفظاً بانتباهه في المهام التي تتطلب تركيز الانتباه." ,0),
        Question(5," (5)  يجد صعوبة في التوقف عن أنشطة اللعب." ,0),
        Question(6," (6) يجد صعوبة في أن يظل هادئًا خلال الحصة أو الدرس أو الجلوس بصفة عامة." ,0),
        Question(7," (7)  يبدو متململاً أو عصبيًا خلال الأداء على المهام أو الأنشطة الأكاديمية  " ,0),
        Question(8," (8) يجد صعوبة في الاستغراق أو الانشغال بالعمل أو اللعب في هدوء.  " ,0),
        Question(9," (9) يتحدث كثيراً، وبصورة مفرطة، وبلا ضوابط أو هدف.  " ,0),
        Question(10," (10)  يتحول من نشاط إلى آخر قبل اكتمال النشاط الذي يبدأه. " ,0),
        Question(11," (11)  يجد صعوبة في متابعة الدروس أو التوجيهات التي تصدر عن المعلمين.  " ,0),
        Question(12," (12) يتشتت انتباهه لأي مثيرات خارج مواقف التعلم.  " ,0),
        Question(13," (13) يبدو مشوشاً تتداخل لديه المثيرات وتختلط عليه المعلومات.  " ,0),
        Question(14," (14) يقاطع أو يتطفل أو يقتحم الآخرين دون مبرر أو استئذان.  " ,0),
        Question(15," (15)   يجيب على الأسئلة باندفاع، وبلا تفكير، وقبل اكتمال سماعها. " ,0),
        Question(16," (16) يجد صعوبة في انتظار دوره في الألعاب أو المواقف " ,0),
        Question(17," (17)  يقحم نفسه بدنياً في أنشطة خطرة دون اعتبار لنتائجها. " ,0),
        Question(18," (18)  يجيب مندفعاً دون التأكد من معرفته الصحيحة للإجابات. " ,0),
        Question(19," (19)   يفقد أو ينسى أدواته اللازمة لأداء الأنشطة المدرسية أو المنزلية أو الرياضية.   " ,0),
        Question(20," (20)  يبدو مهملاً أو غير مهتم أو مكترث بما يكلف أو تكلف به من أنشطة أو مهام.  " ,0),


        )

    var fathyElZayatDataList2 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبات في الفهم الاستماعي للمعلومات التي تقدم شفهيا" ,0),
        Question(2," (2)  يجد صعوبة في فهم المناقشات أو الأسئلة التي توجه إليه. " ,0),
        Question(3," (3)   يجد صعوبة في فهم الكلمات المتماثلة نطقاً والمختلفة معنى." ,0),
        Question(4," (4)   يجد صعوبة في متابعة التعليمات أو الشرح الشفوي للمعلم" ,0),
        Question(5," (5)  يجد صعوبة في تمييز أصوات الحروف أو المقاطع المنطوقة." ,0),
        Question(6," (6)  يجد صعوبة في تهجي أصوات الحروف والمقاطع." ,0),
        Question(7," (7) يجد صعوبة في فهم واتباع التعليمات الشفهية واسترجاعها. " ,0),
        Question(8," (8) يجد صعوبة في إدراك الزمن: لحظة، بعد قليل، بعد ساعة  " ,0),
        Question(9," (9) يحتاج إلى تكرار الشرح الشفهي للمعلومات عدة مرات. " ,0),
        Question(10," (10)   يجد صعوبة في استيعاب معنى المعلومات شفهياً دون تكرار." ,0),
        Question(11," (11)  يفقد انتباهه للمدرس أو الدرس لأي مشتتات خارج الفصل.   " ,0),
        Question(12," (12)  يجد صعوبة في تتبع المثيرات والمعلومات السمعية.  " ,0),
        Question(13," (13)  يجد صعوبة في فهم معنى ومتابعة دلالات الأصوات والإشارات " ,0),
        Question(14," (14)  يجد صعوبة في متابعة شرح المعلم عند المعدل العادي للشرح  " ,0),
        Question(15," (15)  يجد صعوبة في فهم الشرح باستخدام التعبيرات العادية. " ,0),
        Question(16," (16) يجد صعوبة في إكمال مقاطع الكلمات الناقصة المسموعة. " ,0),
        Question(17," (17)   يجد صعوبة في إدراك تركيب الكلمات أو الحروف المسموعة. " ,0),
        Question(18," (18)  يصعب عليه إدراك معنى الكلمات المسموعة ناقصة حرف أو أكثر. " ,0),
        Question(19," (19)   يجد صعوبة في فهم معاني المقاطع المسموعة أو المنطوقة   " ,0),
        Question(20," (20)   يجد صعوبة في الفهم الاستماعي للمفاهيم الواردة.  " ,0),


        )

    var fathyElZayatDataList3 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبة في تمييز الرسوم والخرائط، أو الأشكال الهندسية" ,0),
        Question(2," (2)   يجد صعوبة في التمييز بين الحروف، والكلمات، والأعداد. " ,0),
        Question(3," (3)    يجد صعوبة في التمييز بين الأشياء من حيث اللون والحجم." ,0),
        Question(4," (4) يجد صعوبة في التمييز بين مكونات وتفاصيل الأشكال المرئية." ,0),
        Question(5," (5) يجد صعوبة في تمييز  الشكل  عن الخلفية المحيطة به الأرضية . " ,0),
        Question(6," (6) يجد صعوبة في إدراك الأشكال والرسوم البيانية بصرياً." ,0),
        Question(7," (7) يصعب عليه تجميع أجزاء الأشكال لتكوين الشكل أو الصورة. " ,0),
        Question(8," (8) يجد صعوبة في معرفة الشكل عندما ينقص منه جزء أو أكثر.  " ,0),
        Question(9," (9) يجد صعوبة في إكمال الفراغات بالكلمات أو الحروف أو الأعداد. " ,0),
        Question(10," (10)   يتوه أو يضيع أو يأخذ وقتاً في معرفة الأماكن المألوفة." ,0),
        Question(11," (11)  يجد صعوبة في التعرف على أشكال الحروف الهجائية أو الأعداد.  " ,0),
        Question(12," (12) يجد صعوبة في تمييز الأشكال الهندسية مثل المربع والمستطيل  " ,0),
        Question(13," (13)  يخطئ في كتابة بعض الرموز أو الكلمات مثل ٦ -٢ ،  عمل- علم." ,0),
        Question(14," (14)  يجد صعوبة في القراءة والكتابة والعمليات الحسابية والجداول. " ,0),
        Question(15," (15)   يجد صعوبة في إدراك الجزء بدون الكل أو الكل من أجزائه. " ,0),
        Question(16," (16) يجد صعوبة في الأجهزة والأدوات المعملية كالساعة، والترمومتر." ,0),
        Question(17,"  (17) يجد صعوبة في تذكر المعلومات المتتابعة مثل  ترتيب الحروف الأبجدية، شـهور السنة، أيام الأسبوع .   " ,0),
        Question(18," (18)   يجد صعوبة في استخدام النقط والفواصل في النصوص ." ,0),
        Question(19," (19)  يقرأ ببطء شديد أو يقرأ كلمة-كلمة، وبشكل متقطع.   " ,0),
        Question(20," (20)   يجد صعوبة في إدراك مدلول الحروف والكلمات عند القراءة الجهرية. " ,0),


        )
    var fathyElZayatDataList4 = mutableListOf<Question>(
        Question(1," (1)   يجد صعوبة في القيام بالأنشطة التي تتطلب التآزر بين أعضاء الجسم." ,0),
        Question(2," (2)   يجد صعوبة في التمييز بين اليمين واليسار، والشرق والغرب." ,0),
        Question(3," (3)    يجد صعوبة في مسك الأدوات، والكتابة على السطر." ,0),
        Question(4," (4)  تصدر عنه حركات عصبية تشخيصية عند الكتابة." ,0),
        Question(5," (5)   يجد صعوبة في إحداث تآزر بصري حركي إدراكي. " ,0),
        Question(6," (6) يجد صعوبة في التحدث والتعبير الحركي الشفهي." ,0),
        Question(7," (7) يفقد أماكن الكتابة والقراءة والعمليات الحسابية ورسم الأشكال. " ,0),
        Question(8," (8)  يجد صعوبة في ممارسة أنشطة الركل والمسك والرسم " ,0),
        Question(9," (9) يجد صعوبة في إدراك النشاط الحركي: اليمين واليسار، الدوران للخلف، ثني الجذع .. الخ. " ,0),
        Question(10," (10)  يجد صعوبة في ممارسة أنشطة الجري، والوثب، والركل، واستقبال الكرة." ,0),
        Question(11," (11)   يجد صعوبة في استخدام الأصابع في التآزر الحركي والأعمال الدقيقة." ,0),
        Question(12," (12)  يجد صعوبة في ممارسة الحركات الدقيقة مثل استخدام المقص. " ,0),
        Question(13," (13)   يصعب عليه ممارسة أي عمل يدوي أو بدني بدقة وسرعة." ,0),
        Question(14," (14)  يجد صعوبة في أداء مهارات مثل ارتداء الملابس، أو ركوب الدراجة. " ,0),
        Question(15," (15)  يجد صعوبة في مهارات الرسم والتلوين والأنشطة الرياضية. " ,0),
        Question(16," (16) يجد صعوبة في أداء المهارات الدقيقة مثل استخدام الأدوات الهندسية." ,0),
        Question(17," (17) يجد صعوبة في نطق الأعداد المركبة الأرقام، وتسمية الأشكال.  " ,0),
        Question(18," (18)  يمارس الأنشطة غير الهادفة، ويجد صعوبة في التوقف عنها." ,0),
        Question(19," (19)  يجد صعوبة في حمل الأشياء أو ركوب الدرجات أو اللعب الحركي. " ,0),
        Question(20," (20)  يجد صعوبة في التحكم الحركي مثل ربط الحذاء واستخدام الأدوات " ,0),


        )


   var fathyElZayatDataList5 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبة ملموسة في حفظ وتذكر أشكال الحروف والكلمات." ,0),
        Question(2," (2)   يعاني من تشتت واضطراب في تذكر المعلومات اللفظية." ,0),
        Question(3," (3)   سعة الاستيعاب أو الاحتفاظ لديه ضئيلة." ,0),
        Question(4," (4) يجد صعوبة في تذكر ما يسمع أو يقرأ." ,0),
        Question(5," (5)  يجد صعوبة في تذكر ما يشاهده أو يسمعه خلال فترات وجيزة. " ,0),
        Question(6," (6) يجد صعوبة في حفظ المعلومات والأشكال واسترجاعها ." ,0),
        Question(7," (7) يجد صعوبات في التحصيل الأكاديمي لمعظم المواد الدراسية. " ,0),
        Question(8," (8) يجد صعوبة في تذكر أو استرجاع ما يسمع أو يقرأ " ,0),
        Question(9," (9)  يجد صعوبة في الاحتفاظ بالمعلومات ومعالجتها ذهنياً. " ,0),
        Question(10," (10)   يجد صعوبة في استرجاع أو تذكر الرسوم والجداول والأماكن." ,0),
        Question(11," (11)   يجد صعوبة في استرجاع الأرقام والأعداد والمعلومات والقواعد." ,0),
        Question(12," (12)  يصعب عليه حفظ التعليمات التي يشاهدها أو يسمعها لمدة وجيزة. " ,0),
        Question(13," (13)   يجد صعوبة في تذكر ما يطلب منه من واجبات مدرسية. " ,0),
        Question(14," (14)   يجد صعوبات في تذكر الأحداث أو المواقف الحياتية واليومية. " ,0),
        Question(15," (15)   يجد صعوبة في حفظ تتابع أو ترتيب المعلومات أو المهارات. " ,0),
        Question(16," (16)  يفشل في تذكر الآليات والاستراتيجيات المناسبة للموقف المشكل." ,0),
        Question(17," (17) يجد صعوبات في تذكر النصوص أو القصائد الأكاديمية أو الدراسية.  " ,0),
        Question(18," (18)  يجد صعوبة في تذكر ترتيب الشهور أو تذكر جدول الضرب. " ,0),
        Question(19," (19)  يفشل في حفظ حقائق، أو قوانين، أو قواعد الرياضيات، وعلاقات. " ,0),
        Question(20," (20) يفشل في الاحتفاظ بما سبق تعلمه، وإعادة استخدامه، أو توظيفه. " ,0),


        )


        var fathyElZayatDataList6 = mutableListOf<Question>(
            Question(1," (1)  يبدو عصبياً – متململاً – عبوساً عندما يقرأ" ,0),
            Question(2," (2)   يقرأ بصوت مرتفع وحاد – يضغط على مخارج الحروف" ,0),
            Question(3," (3)   يقاوم القراءة، يبكي، يفتت والمقاطع والكلمات" ,0),
            Question(4," (4) يفقد مكان القراءة، ويعيد ما يقرأ بصورة متكررة" ,0),
            Question(5," (5)  ينطق بطريقة متقطعة متشنجة خلال القراءة " ,0),
            Question(6," (6) يبدو قلقاً مرتبكاً، يقرب مواد القراءة من عينيه" ,0),
            Question(7," (7)  يحذف بعض الكلمات، يقفز من موقع إلى آخر أثناء القراءة " ,0),
            Question(8," (8)  يستبدل بعض الكلمات بكلمات أخرى غير موجودة بالنص " ,0),
            Question(9," (9)   يعكس/ أو يستبدل بعض الحروف والكلمات " ,0),
            Question(10," (10)   يخطئ في نطق الكلمات/ يعاني من سوء نطق الحروف" ,0),
            Question(11," (11)   يقرأ دون أن يبدي نوع من الفهم لما يقرأ" ,0),
            Question(12," (12)  يقرأ الكلمات بترتيب خاطئ " ,0),
            Question(13," (13)    يبدي ترددا عند الكلمات التي لا يستطيع نطقها " ,0),
            Question(14," (14)   يجد صعوبة في التعرف على الحروف والمقاطع والكلمات " ,0),
            Question(15," (15)    يجد صعوبة في استنتاج الحقائق والمعاني الواردة في النص " ,0),
            Question(16," (16)  يفشل في إعادة مضمون قصة قصيرة بعد قراءة" ,0),
            Question(17," (17) يعجز عن استنتاج الفكرة الرئيسية لما يقرأ  " ,0),
            Question(18," (18)   يقرأ بطريقة متقطعة: حرف حرف، مقطع مقطع، كلمة كلمة " ,0),
            Question(19," (19)  يقرأ بصوت مرتفع وحاد، ومتشنج " ,0),
            Question(20," (20) يجد صعوبة في استخدام النقط والفواصل والوقف عند القراءة " ,0)
        )


        var fathyElZayatDataList7 = mutableListOf<Question>(
            Question(1," (1)  يجد صعوبة في نسخ الفقرات والواجبات والأعمال الكتابية" ,0),
            Question(2," (2)   يجد صعوبة في التعبير الكتابي عما يريد" ,0),
            Question(3," (3)   يجد صعوبة في أن يميز اللام الشمسية، واللام القمرية، وبين الحروف الكـبيرة Capital والصغيرة Small في اللغة الإنجليزية" ,0),
            Question(4," (4) يجد صعوبة في الكتابة على سطور الكراسات العادية للكتابة" ,0),
            Question(5," (5)   يجد صعوبة في نسخ بعض الحروف والأشكال على نحو صحيح " ,0),
            Question(6," (6) يجد صعوبة في كتابة أدوات الوصل الملائمة للحروف والكلمات" ,0),
            Question(7," (7)  يجد صعوبة في كتابة الحروف الهجائية من الذاكرة مكوناً كلمات " ,0),
            Question(8," (8)  يجد صعوبة في كتابة المتصلة مكوناً كلمات وجمل منضبطة " ,0),
            Question(9," (9)   يجد صعوبة في تنسيق واجباته اليومية المكتوبة " ,0),
            Question(10," (10)   يجد صعوبة في كتابة بالقلم الحبر والقلم الجاف" ,0),
            Question(11," (11)   يجد صعوبة في أن يكتب بطلاقة ومرونة ونعومة" ,0),
            Question(12," (12)  يجد صعوبة في أن يحتفظ بأدوات الكتابة والرسم والألوان " ,0),
            Question(13," (13)  يجد صعوبة في عمل الرسوم، والخرائط، والعناوين المكتوبة " ,0),
            Question(14," (14)    يجد صعوبة في كتابة الحروف والأرقام بشكل مقبول ومنظم " ,0),
            Question(15," (15)    يجد صعوبة في الالتزام بالحيز المخصص للكتابة" ,0),
            Question(16," (16)  يجد صعوبة في الكتابة بشكل سلس وناعم" ,0),
            Question(17," (17) يجد صعوبة في الكتابة وفقاً لقواعد الخط والكتابة اليدوية  " ,0),
            Question(18," (18)   يجد صعوبة في المحافظة على حجم الكتابة وتنسيقها " ,0),
            Question(19," (19)  يجد صعوبة في تنظيم مسافات الحروف والكلمات والجمل " ,0),
            Question(20," (20) كتاباته مفككة ركيكة، مع ضعف القدرة على التعبير " ,0)
        )


        var fathyElZayatDataList8 = mutableListOf<Question>(
            Question(1," (1)  يجد صعوبة في التمييز بين الأرقام مثل:(٢،٦) ، (٧،٨)" ,0),
            Question(2," (2)   يجد صعوبة في إجراء عمليات الضرب والقسمة المطولة" ,0),
            Question(3," (3)يجد صعوبة في حل مسائل الجمع مع الحمل والطرح مع الاستلاف" ,0),
            Question(4," (4) يضع أرقام أو فاصلة الكسور العشرية في غير مكان" ,0),
            Question(5," (5)    يجد صعوبة في الاستخدام الصحيح لعلامات أكبر من، أصغر من " ,0),
            Question(6," (6) يجد صعوبة في حل المسائل اللفظية الشفهية المتعددة الخطوات" ,0),
            Question(7," (7)  يجد صعوبة في فهم القيم المكانية للأرقام وكتابتها وفقاً لها " ,0),
            Question(8," (8)  يجد صعوبة في حفظ الحقائق الرياضية، والاحتفاظ بها" ,0),
            Question(9," (9)   يجد صعوبة في فهم معنى الرموز الرياضية" ,0),
            Question(10," (10)    ينسى القواعد الرياضية المتعلقة بالدروس السابقة" ,0),
            Question(11," (11)   يجد صعوبة في حل المسائل متعددة الخطوات وتمييز ناتج الحل" ,0),
            Question(12," (12)  يجد صعوبة في تحويل الصياغات اللفظية للمسائل إلى رموز رياضية " ,0),
            Question(13," (13)  يجد صعوبة في حل المسائل الرياضية أو الحسابية عقلياً " ,0),
            Question(14," (14) يجد صعوبة في التحويل بين الوحدات الأكبر والأصغر (مم، سم، متر،كم) " ,0),
            Question(15," (15)  يجد صعوبة في تمييز الحجم، والكمية، والمسافة، والزمن" ,0),
            Question(16," (16)  يجد صعوبة في فهم واستخدام الرموز الرياضية مثل: >، <، س٢" ,0),
            Question(17," (17) يجد صعوبة في حل المسائل التي تتطلب تنوع في العمليات الحسابية  " ,0),
            Question(18," (18)   يحتاج إلى تصحيح كل خطوة في المسائل متعددة الخطوات " ,0),
            Question(19," (19)  يجد صعوبة في تركيب الأعداد تصاعدياً أو تنازلياً " ,0),
            Question(20," (20) يجد صعوبة في جمع وطرح وضرب الإشارات عند حل المسائل " ,0)
        )



        var fathyElZayatDataList9 = mutableListOf<Question>(

            Question(1," (1)  يجد صعوبة في أن يجلس أو يظل ساكناً أو هادئاً قليلاً" ,0),
            Question(2," (2)   يؤدي واجباته وهو يجري، أو يتحرك، وبشكل متقطع" ,0),
            Question(3," (3)كثير الخروج من مقعده، وخلط أوراقه أو الشخبطة فيها" ,0),
            Question(4," (4) كثير التحرك في مقعده في الفصل أو البيت بلا هدف" ,0),
            Question(5," (5) دائم التحريك لقدمه أو ساقه، ينقر بقلمه على درجه " ,0),
            Question(6," (6) يتعرض للحوادث والجروح في أنشطته كالجري وركوب الدراجة" ,0),
            Question(7," (7)  يندفع في حركاته وأنشطته، وردود أفعاله " ,0),
            Question(8," (8)  يحتاج بصورة مستمرة لتعزيز السلوك غير الحركي" ,0),
            Question(9," (9)   يحتاج لجدول عمل يومي والتذكير المستمر به" ,0),
            Question(10," (10) يفرط في الحركة غير الهادفة داخل الفصل أو البيت" ,0),


            Question(11," (11)   سريع، وسهل التشتت، وذو سعة انتباهية قصيرة" ,0),
            Question(12," (12)  لا يمكنه العمل على واجباته لفترة طويلة نسبيًا " ,0),
            Question(13," (13)  يتشتت عند متابعة أداء الواجبات لأي ضوضاءً " ,0),
            Question(14," (14)  يترك نفسه لأحلام اليقظة، شارد، أو هائم " ,0),
            Question(15," (15)  لا يهتم بأداء واجباته أو ما هو مطلوب منه ذاتيًا" ,0),
            Question(16," (16) يتأثر بأي مشتتات سمعية، أو بصرية" ,0),
            Question(17," (17) يتحدث بصوت منخفض عند أدائه لأي عمل يكلف به  " ,0),
            Question(18," (18)    سهل الاستثارة، عصبي أو حاد المزاج " ,0),
            Question(19," (19)  يدخل في نوبات مفاجئة من البكاء دون أسباب معروفة " ,0),
            Question(20," (20) يبدو عليه الميل للنوم أثناء الدروس أو أداء الواجبات" ,0),


            Question(21," (21)   يفشل في أداء المهام بصورة متكررة خلال سنواته المدرسية" ,0),
            Question(22," (22)  يجد صعوبة في تكوين الصداقات، لا يتعاون مع أقرانه " ,0),
            Question(23," (23)  يجد صعوبة في أداء أي واجبات أو تكليفات مدرسيةً " ,0),
            Question(24," (24)  ضعيف الشعور بفشله أو تكرار تعرضه لخبرات الفشل " ,0),
            Question(25," (25)  ضعف الثقة بنفسه وقدراته ومعلوماته" ,0),
            Question(26," (26) ينسحب من مواقف التنافس الاجتماعي أو الأكاديمي" ,0),
            Question(27," (27) يبدي كثير من الخوف والاضطراب عند أداء الاختبارات  " ,0),
            Question(28," (28)    لا يهتم بدقة أو صحة استجابة، ولا يراجعها " ,0),
            Question(29," (29)  يعزو فشله المتكرر إلى الآخرين أو الظروف أو المرض " ,0),
            Question(30," (30)  يحتاج إلى التشجيع والدعم المستمر لضعف مفهوم الذات لديه" ,0),


            Question(31," (31)   متهور أو أحمق لا يهتم بآثار سلوكه على الآخرين" ,0),
            Question(32," (32)  يبدو غير متعاون لا يقدم أي عون أو مساعدة للغير " ,0),
            Question(33," (33)  يجد صعوبة في التفاعل الاجتماعي المقبول من الآخرين " ,0),
            Question(34," (34)  يهمل الإنصات لحديث الآخرين أو الاهتمام به " ,0),
            Question(35," (35)  يجد صعوبة في القيام بالمهارات الاجتماعية الملائمة" ,0),
            Question(36," (36) يقاطع أي حديث يتم بين أي فردين أو عدة أفراد" ,0),
            Question(37," (37) يتجاهل متابعة زملائه لحديثه أو انتباههم له  " ,0),
            Question(38," (38) يتجاهل ردود فعل الآخرين تجاه ما يصدر عنه من سلوك " ,0),
            Question(39," (39)  دائرة أصدقائه ضعيفة، لضعف وقلة مشاركته لهم " ,0),
            Question(40," (30)  يتجاهله زملاؤه في المشاركات أو الأعمال التعاونية" ,0),



            Question(41," (41)   يقبل على أي عمل باندفاع وور ودون إدراك للنتائج" ,0),
            Question(42," (42)  يندفع في إنهاء تكليفاته أو واجباته بسرعة مع الخطأ" ,0),
            Question(43," (43)  يخطئ نتيجة اندفاعه وتسرعه في الإجابة " ,0),
            Question(44," (44)  يتحدث دون إذن، أو في وقت غير مناسب، ودون هدف " ,0),
            Question(45," (45)  يستجيب بسرعة واندفاع وبلا أدنى تفكير" ,0),
            Question(46," (46) يقدم أعماله وإجاباته بإهمال وبسرعة وبلا مراجعة" ,0),
            Question(47," (47) يهمل في تنظيم أعماله، ملابسه وأدواته  " ,0),
            Question(48," (48) متهور، أو أحمق، أو طائش، يندفع مع الخطأ في استجاباته" ,0),
            Question(49," (49)  يصعب عليه تأجيل حاجاته، أو إشباعاته، أو طلباته " ,0),
            Question(50," (50)   لا يهتم بشكل، ونوع استجاباته، وتأثيرها على الآخرين" ,0),


            Question(51," (51)   يميل إلى مضايقة الآخرين بالفعل أو اللفظ، دائماً مزعج" ,0),
            Question(52," (52)  يميل إلى افتعال العراك أو المشاكسة لزملائه" ,0),
            Question(53," (53)  يبدو مستثارًا، يجد صعوبة في تعديل سلوك العدوان لديه " ,0),
            Question(54," (54)   يتكرر تعرضه للجروح أو الكسور بسبب سلوك العنف لديه " ,0),
            Question(55," (55)  يؤذي زملائه عشوائيًا خلال ممارسته اللعب معهم" ,0),
            Question(56," (56) يحتاج بصورة متكررة لتعزيز السلوك السوي المرغوب" ,0),
            Question(57," (57) يميل إلى إتلاف كتبه أو أوراقه أو دفاتره " ,0),
            Question(58," (58)  أقلامه عادة لا تعمل، أو مكسورة، او غير كاملة" ,0),
            Question(59," (59)   يكتب على درجه بصورة مشوهة تخريبية " ,0),
            Question(60," (60)   يستثار لأبسط سبب ويرد بعنف لا يتناسب مع السبب" ,0),


            Question(61," (61)   يميل إلى العمل أو اللعب أو حتى الأكل وحيدًا" ,0),
            Question(62," (62)  صامت معظم الوقت، يجلس في مقعده هادئ تمامًا" ,0),
            Question(63," (63)  يتهرب أو ينسحب من مواقف التنافس التحصيلي " ,0),
            Question(64," (64)   يتهرب من المناقشة أو المواقف الاجتماعية مع أقرانه " ,0),
            Question(65," (65)  يبدأ الحديث أو المناقشة، ويتجنب الانضمام إلى أقرانه" ,0),
            Question(66," (66)  يبدو سلبيًا في تناول المواقف، أو التفاعل معها" ,0),
            Question(67," (67) غير مبادئ أو لا يبدأ الحديث أو المناقشة " ,0),
            Question(68," (68)  يعتذر عن الدعوات مدعياً أعذار لا مبرر لها" ,0),
            Question(69," (69)   يقنع بأي إنجاز يحققه، ويفتقر إلى روح التنافس" ,0),
            Question(70," (70)   يتغيب في الحفلات، أو الأنشطة المدرسية" ,0),



            Question(71," (71)   ينفذ ما يطلب منه حرفيًا دون أن يكون له رأي" ,0),
            Question(72," (72)  يقلد الآخرين تمامًا، ويحتاج إلى التشجيع المستمر" ,0),
            Question(73," (73)  عندما يكلف بمهام يردد دون تفكير: لا يمكنني، لا أعرف " ,0),
            Question(74," (74)   يوجه انتباهه إلى ما يقوم به غيره تاركاً ما بيده " ,0),
            Question(75," (75)  يعتمد على الغير ويكرر طلب كل المساعدات الممكنة" ,0),
            Question(76," (76)  يلجأ إلى مدرسته أو زملائه مرددًا ساعدني أو أرني كيف؟" ,0),
            Question(77," (77) يكرر عبارة \"يصعب علي\" حتى قبل أن يعرف طبيعة المهام " ,0),
            Question(78," (78)  يفضل الأعمال التي يمكنه أداؤها بمساعدة الآخرين" ,0),
            Question(79," (79)   يفضل ممارسة الأنشطة التي يسهل عليه النجاح فيها " ,0),
            Question(80," (70)   يفضل ممارسة الأنشطة منفردًا بلا تواجد مباشر للآخرين" ,0),




            )



    }
}