package com.example.mente.Data.QuestionsParent.data


import com.example.mente.Models.ParentTestModel

class DataParentTests {

    companion object{

        var ParentTestOne = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يثبت بصره لمدة 3 ثواني على الأقل؟",1),
            ParentTestModel(2,"هل يتتبع بعينيه لعبة تتحرك يمينًا ويسارًا؟\n",1),
            ParentTestModel(3,"هل يتتبع بعينيه لعبة تتحرك أعلى وأسفل؟\n",1),
            ParentTestModel(4,"هل يتتبع بعينيه لعبة تتحرك في مسار بصري دائري؟",1),
            ParentTestModel(5,"هل يأخذ ردة فعل عندما يسمع صوتًا قويًا، أو ضوءًا ساطعًا؟\n",1),
            ParentTestModel(6,"هل يحدق بشكل أطول حيث اختفت الأشياء، والأشخاص؟",1),
            ParentTestModel(7,"هل يظهر ترقب لحدث يحدث بانتظام خلال الأحداث اليومية -مثال- عند رجوعه من الروضة ينتظر إحضار الطعام له؟\n",1),
            ParentTestModel(8,"هل يسترجع الأشياء المخبأة جزئيًا تحت غطاء؟ ",1),
            ParentTestModel(9,"هل يستجيب بالنظر عند سماع اسمه؟\n",1),
            ParentTestModel(10,"هل يتصل ببصره معك عند ندائه أثناء تواجده في مجموعة مع غيره من الأطفال؟\n",1),
            ParentTestModel(11,"هل ينظر إلى شيء أبعد عن الحيز المباشر لرؤيته؟ -مثال- يجلس في غرفته وينظر إلى خارجها؟\n",1),
            ParentTestModel(12,"هل يخرج شيئًا بيده من وعاء مفتوح؟\n",1),
            ParentTestModel(13,"هل يهز لعبة تصدر صوتًا مربوطة بحبل؟\n",1),
            ParentTestModel(14,"هل يرفع الدائرة من لوحة الأشكال الهندسية؟\n",1),
            ParentTestModel(15,"هل يعثر على الأشياء التي تم إخفائها؟",1),
            ParentTestModel(16,"هل يُركز لمدة طويلة في المكان الذي يختفي من خلاله شيء أو شخص ما؟",1),
            ParentTestModel(17,"هل يستعيد الشيء الذي تم اخفاء جزئيًا أسفل غطاء؟",1),
            ParentTestModel(18,"هل يستعيد الشيء الذي تم اخفاءه تمامًا أسفل غطاء؟",1),
            ParentTestModel(19,"هل يجد شيئًا تم تخبئته تحت طبق من ضمن ثلاثة أطباق؟",1),
            ParentTestModel(20,"هل يعثر على لعبة أسفل أو بداخل أحد وعائين بعد عكس موضعهم؟\n",1),
            ParentTestModel(21,"هل يركز انتباهه على كتاب مصور وكل ما يتعلق به لمدة لا تقل عن خمس دقائق أثناء الجلوس برفقتك -مثال- \"يشير على الكرسي الموجود بالغرفة إذا وجد صورة كرسي في الكتاب\"؟\n",1),
            ParentTestModel(22,"هل يبدي ردة فعل على التغير الذي يطرأ على أحد الألعاب المألوفة له، أو في حالة اختفاء الأشياء، أو عدم أدائها وظائفها المعتادة؟\n",1),
            ParentTestModel(23,"هل يحدد شيئًا معينًا من ثلاثة أشياء موضوعة تحت 3 أغطية بعدما نظر إليها؟ ",1)
        )


        var ParentTestTwo = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يهز لعبة تصدر صوتًا مربوطة بحبل؟\n",1),
            ParentTestModel(2,"هل يجد شيئاً مخبئًا تحت وعاء؟\n",1),
            ParentTestModel(3,"هل  يستجيب طفلك للمس، مثل احتضانه أو دغدغته؟",1),
            ParentTestModel(4,"هل يشخبط على الورق؟\n",1),
            ParentTestModel(5,"هل يشير إلى نفسه عند سؤاله أين \"اسمه\"؟\n",1),
            ParentTestModel(6,"هل يقلب صفحات الكتاب 2 : 3 صفحات في المرة ليميز صوره مسماة؟\n",1),
            ParentTestModel(7,"هل يخبر عما إذا كان ذلك الشئ \"أثقل\" أم \"أخف\" -الفرق بسيط-؟",1),
            ParentTestModel(8,"هل يصنف حسب الحجم (كبير وصغير)؟",1),
            ParentTestModel(9,"هل يطابق الألوان الرئيسية؟\n",1),
            ParentTestModel(10,"هل يصنف حسب الشكل؟\n",1),
            ParentTestModel(11,"هل يصنف حسب صفتين؟\n",1),
            ParentTestModel(12,"هل يبدو أن طفلك يلاحظ ويستجيب لأصوات مختلفة، مثل صوتك، أو لعبة تصدر ضوضاء، أو نباح كلب بالخارج؟\n",1),
            ParentTestModel(13,"هل يستجيب طفلك للأشياء التي يراها في المرآة، مثل صورته أو شخص آخر في الغرفة؟\n",1),
            ParentTestModel(14,"هل يعثر على لعبة بعد تخبئتها في مكانين معتادين بالنسبة له بدون رؤيتها عند تخبئتها؟ \n",1),
            ParentTestModel(15,"هل يعثر على لعبة بعد تخبئتها في ثلاثة أماكن معتادة بالنسبة له بدون رؤيتها عند تخبئتها؟ ",1),
            ParentTestModel(16,"هل يبدو أن طفلك قادر على فهم واتباع التعليمات البسيطة، مثل \"تعال إلى هنا\" أو \"أعطني اللعبة\"؟\n",1),
            ParentTestModel(17,"هل يمكن لطفلك تحديد وتسمية الأشكال الأساسية، مثل الدوائر والمربعات والمثلثات؟\n",1),
            ParentTestModel(18,"هل يبدو طفلك مستجيبًا لتفاصيل معينة، مثل الألعاب المفضلة أو الأغاني؟\n",1),
            ParentTestModel(19,"هل يمكن لطفلك التعرف على الألوان والأشكال والأحجام وتسميتها؟\n",1),
            ParentTestModel(20,"هل يفهم طفلك المفاهيم الأساسية مثل \"كبير\" و \"صغير\" و \"داخل\" و \"خارج\" و \"لأعلى\" و \"لأسفل\"؟\n",1),
            ParentTestModel(21,"هل يمكن لطفلك مطابقة الأشياء حسب اللون أو الشكل أو الحجم؟\n",1),
            ParentTestModel(22,"هل يبدي طفلك اهتمامًا باستكشاف المواد والأشياء وتجربتها؟\n",1),
            ParentTestModel(23,"هل يمكن لطفلك التعرف على أجزاء الجسم والملابس والأشياء المنزلية وتسميتها؟\n",1),
            ParentTestModel(24,"هل يفهم طفلك العلاقات المكانية ، مثل \"أمام\" و \"خلف\" و \"بجانب\"؟\n",1),
            ParentTestModel(25,"هل يمكن لطفلك فهم مفهوم \"نفس الشيء\" و \"مختلف\"؟\n",1),
            ParentTestModel(26,"هل يبدي طفلك اهتمامًا بتعلم أشياء جديدة وتجربة تجارب جديدة؟\n",1),
            ParentTestModel(27,"هل يتعرف على العملات النقدية نصف جنيه وجنيه؟\n",1),
        )


        var ParentTestThree = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يزيل قطعة قماش عندما توضع على وجهه؟\n",1),
            ParentTestModel(2,"هل يعبر طفلك البالغ من العمر عامًا واحدًا عن رغباته، واحتياجاته باستخدام الكلمات، أو الإشارات؟ \n",1),
            ParentTestModel(3,"هل يضع شيئًا في وعاء عندما يطلب منه ذلك لفظيًا؟\n",1),
            ParentTestModel(4,"هل ينقل شيئًا من يد إلى الأخرى ليلتقط شيئًا آخر؟\n",1),
            ParentTestModel(5,"هل يؤدي حركات بسيطة عند طلبها؟\n",1),
            ParentTestModel(6,"هل يبسط ذراعه وصولاً إلى الأشياء المتواجدة في مجال رؤيته وتتصل حسيًا بجسمه؟\n",1),
            ParentTestModel(7,"هل يكرر ممارسة الأنشطة التي تجلب له الاستمتاع؟\n",1),
            ParentTestModel(8,"هل يلعب باللعب التي يتم وضعها بيده؟\n",1),
            ParentTestModel(9,"هل يكرر الأفعال التي تلقي استجابات لطيفة من الآخرين؟\n",1),
            ParentTestModel(10,"هل يبذل المحاولات إصرارًا على الحصول على شيء أو إنتاج تأثير؟\n",1),
            ParentTestModel(11,"هل يبسط ذراعه وصولًا إلى الأشياء التي تحدث ضوضاء عند سقوطها من مجال رؤيته على الأرض؟\n",1),
            ParentTestModel(12,"هل يبسط ذراعه وصولًا إلى الأشياء التي لا تحدث ضوضاء عند سقوطها من مجال رؤيته على الأرض؟\n",1),
            ParentTestModel(13,"هل يتحرك في الاتجاه الصحيح نحو الأشياء التي تسقط أو تتدحرج أو ترتد إلي مكان جديد؟\n",1),
            ParentTestModel(14,"هل يتخطى العوائق التي تعترض طريقه لإحضار اللعب؟\n",1),
            ParentTestModel(15,"هل يلعب بالعديد من اللعب لإنتاج تأثيرات متنوعة؟\n",1),
            ParentTestModel(16,"هل يبذل مجهودًا أكبر مع اللعب في حالة توقفها عن العمل أو محاولة تشغيلها بطريقة أخرى - سيارة تتحرك بواسطة خيط وعند تلف الخيط يحركها بيديه- ",1),
            ParentTestModel(17,"هل يستعيد اللعب من داخل وعاء ما بعد إسقاطها داخل هذا الوعاء عبر فتحة موجودة أعلاه؟\n",1),
            ParentTestModel(18,"هل يرص 3 مكعبات فوق بعض عندما يطلب منه ذلك؟\n",1),
            ParentTestModel(19,"هل يشير إلى صورة مسماة؟\n",1),
            ParentTestModel(20,"هل يجد كتابًا بعينه عندما يطلب منه ذلك؟\n",1),
            ParentTestModel(21,"هل يشير إلى الكبير والصغير عندما يطلب منه ذلك؟\n",1),
            ParentTestModel(22,"هل يضع الأشياء \"في وعلى وتحت\" عندما يطلب منه ذلك؟\n",1),
            ParentTestModel(23,"هل يسمي الأفعال التي تعبر عنها الصور؟\n",1),
            ParentTestModel(24,"هل يشير إلى عشرة أجزاء من جسمه عندما يسأل عن ذلك؟\n",1),
            ParentTestModel(25,"هل يبسط الذراع وصولًا إلى شيء موجود خلف حاجز؟\n",1),
            ParentTestModel(26,"هل يسحب الخيط المتدلي من شيء ما بهدف إحضار ذلك الشيء من خلف حاجز؟\n",1),
            ParentTestModel(27,"هل يتحرك حول أي عائق أمامه للحصول على شيء موجود خلفه؟\n",1),
            ParentTestModel(28,"هل يستعين بالأشخاص البالغين في حل المشكلات؟",1),
            ParentTestModel(29,"هل يحل المشكلات البسيطة دون الحاجة إلى مساعدة أشخاص بالغين؟\n",1),
            ParentTestModel(30,"هل يعيد الأشياء إلى أماكنها الصحيحة بعد الانتهاء من استخدامها؟\n",1),
            ParentTestModel(31,"هل يستخدم الأدوات في حل المشكلات؟\n",1),
            ParentTestModel(32,"هل يصف شيئًا ما بأنه معطل أو تالف في حالة عدم إنتاج ذلك الشيء للتأثير الذي يتوقعه؟\n",1),
            ParentTestModel(33,"هل يجيب بشكل صحيح على سؤال واحد على الأقل يبدأ بكلمة الاستفهام\" لماذا\"؟\n",1),
        )


        var ParentTestFour = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يظهر ترقب لحدث يحدث بانتظام خلال الأحداث اليومية -مثال- عند رجوعه من الروضة ينتظر إحضار الطعام له؟\n",1),
            ParentTestModel(2,"هل يتوقع الأحداث التي تقع أثناء ممارسة الألعاب المألوفة له بعد ممارسة تلك الألعاب لمرتين أو ثلاث مرات؟\n",1),
            ParentTestModel(3,"هل يتوقع الأحداث التي تقع أحيانًا أثناء ممارسة الألعاب المألوفة له بعد ممارسة تلك الألعاب مرة واحدة؟\n",1),
            ParentTestModel(4,"هل يستعيد الشيء الذي تم اخفاءه تمامًا أسفل الغطاء؟\n",1),
            ParentTestModel(5,"هل يمكن لطفلك تحديد أنواع مختلفة من الطعام وتسميتها، مثل الفاكهة، أو الخضار؟\n",1),
            ParentTestModel(6,"هل يتذكر  طفلك أماكن الأشياء التي تم التوقف عن استخدامها لدقائق معدودة؟\n",1),
            ParentTestModel(7,"هل يبدي طفلك ردة فعل على التغير الذي يطرأ على أحد الألعاب المألوفة له أو في حالة إختفاء الأشياء أو عدم أدائها لوظائفها المعتادة؟\n",1),
            ParentTestModel(8,"هل يميز طفلك الأشخاص\"بما فيهم أفراد الأسرة والأشخاص القائمين بالرعاية\" و الأماكن المألوفة له؟",1),
            ParentTestModel(9,"هل يميز طفلك بين الملابس واللعب والمتعلقات الشخصية الخاصة به والخاصة بالآخرين؟\n",1),
            ParentTestModel(10,"هل يحضر طفلك اللعب الخاصة به من أماكنها المعتادة؟\n",1),
            ParentTestModel(11,"هل يحضر طفلك شيئًا ما من مكانه المعتاد إذا ما طلب منه ذلك شفهياً أو بالإشارة؟\n",1),
            ParentTestModel(12,"هل يعيد طفلك الأشياء إلى أماكنها الصحيحة بعد الانتهاء من استخدامها وملاحظة وجود تلك الأشياء في أماكن بخلاف أماكنها الصحيحة؟\n",1),
            ParentTestModel(13,"هل يردد طفلك أجزاء أغاني الأطفال أو حكايات الأطفال المغناة دون مساعدة؟\n",1),
            ParentTestModel(14,"هل يستطيع طفلك تسمية أربعة أشياء بدون مساعدة (فواكه، حيوانات)؟\n",1),
            ParentTestModel(15,"هل يستطيع طفلك النظر إلى صور عدة ثواني ثم وصف الصورة بشكل واضح؟\n",1),
            ParentTestModel(16,"هل يستطيع طفلك تذكر رسالة قصيرة مكونة من 4 لـ 6 كلمات وتوصيلها لشخص آخر؟\n",1),
            ParentTestModel(17,"هل يستطيع العد إلى 5 بدون مساعدة؟\n",1),
            ParentTestModel(18,"هل يتذكر قصة مرئية ويرويها بمفرده؟\n",1),
            ParentTestModel(19,"هل يعاني طفلك من صعوبة في اتباع التعليمات أو التوجيهات التي يتم إعطاؤها شفويًا؟\n",1),
            ParentTestModel(20,"هل يمكن لطفلك أن يتذكر أين رأى شيئًا معينًا في الماضي؟\n",1),
            ParentTestModel(21,"هل يمكن لطفلك أن يتذكر تفاصيل حول شخص رآه وسمعه من قبل، مثل صديق أو أحد أفراد الأسرة؟\n",1)
        )


        var ParentTestFive = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يضع طفلك شيئًا في وعاء مقلدًا الآخرين؟\n",1),
            ParentTestModel(2,"هل يسقط لعبة ويلتقطها؟\n",1),
            ParentTestModel(3,"هل يدفع ثلاث مكعبات مرتبة في شكل قطار؟\n",1),
            ParentTestModel(4,"هل يشير إلى جزء واحد من أجزاء خمسة؟\n",1),
            ParentTestModel(5,"هل يطابق الأشياء المتماثلة؟\n",1),
            ParentTestModel(6,"هل يطابق الأشياء مع صورها؟\n",1),
            ParentTestModel(7,"هل يرسم خطًا رأسيًا مقلدًا؟\n",1),
            ParentTestModel(8,"هل يرسم خطًا أفقيًا مقلدًا؟\n",1),
            ParentTestModel(9,"هل ينسخ دائرة؟\n",1),
            ParentTestModel(10,"هل يطابق الأشياء حسب الملمس؟\n",1),
            ParentTestModel(11,"هل يرسم علامة \" + \" مقلدًا؟\n",1),
            ParentTestModel(12,"هل يطابق ثلاثة ألوان؟\n",1),
            ParentTestModel(13,"هل يُركب لعبة متداخلة مكونة من أربعة قطع؟\n",1),
            ParentTestModel(14,"هل يطابق الأشكال الهندسية مع صور لتلك الأشكال؟\n",1),
            ParentTestModel(15,"هل يرص خمسة حلقات أو أكثر علي وتد بترتيب أحجامها؟\n",1),
            ParentTestModel(16,"هل يمكن لطفلك تخيل ووصف أنواع مختلفة من الحيوانات أو المخلوقات؟\n",1),
            ParentTestModel(17,"هل يمكن لطفلك تخيل ووصف أنواع مختلفة من الأطعمة أو المشروبات؟\n",1),
            ParentTestModel(18,"هل يبادر بعمل حركات للاستمرار في نشاط مألوف؟\n",1),
            ParentTestModel(19,"هل يمد لعبة بيده ليريها للآخرين بدون أن يتخلى عنها؟ \n",1),
            ParentTestModel(20,"هل يعطي اللعبة إلى شخص مألوف له تلقائيًا أو عند طلبها منه؟\n",1),
            ParentTestModel(21,"هل يظهر سلوك الاعتماد على الغير  بالبكاء على الرغم من قدرته على الاعتماد على ذاته؟\n",1),
            ParentTestModel(22,"هل يعطي أهمية لممتلكاته، ويستخدم كلمة \"بتاعتي\" عندما يحاول أحد أخذها منه؟\n",1),
            ParentTestModel(23,"هل يستطيع التمييز بين جنسه والجنس الآخر - مثال- يجيب إجابة صحيحة عندما يُسأل إن كان ولدًا أو بنتًا.\n",1),
            ParentTestModel(24,"هل يفتخر بإنجازاته، يرفض المساعدة -مثال-  يبتسم أو يصفق.. عندما ينجز مهمة دون الاحتياج لتشجيع خارجي كبير؟\n",1)
        )


        var ParentTestSix = mutableListOf<ParentTestModel>(
            ParentTestModel(1,"هل يقلد حركتين بسيطتين عند اللعب بالصلصال؟\n",1),
            ParentTestModel(2,"هل ينظر  طفلك إلى الشخص القائم بالرعاية وعمل حركات بالوجه عند التحدث الشخص القائم بالرعاية أو قيامه بعمل ضوضاء؟\n",1),
            ParentTestModel(3,"هل يستمر  في الحركة في حالة محاكاة حركاته من جانب الشخص القائم بالرعاية؟\n",1),
            ParentTestModel(4,"هل يحاكي فعلًا مختزنًا بذاكرته بعد ملاحظة أداء الشخص القائم بالرعاية لذلك الفعل؟\n",1),
            ParentTestModel(5,"هل يحاكي الحركات غير المألوفة له؟ \n",1),
            ParentTestModel(6,"هل يحاكي الإيماءات البسيطة كإشارة بما يوحي بمعنى \"إلى اللقاء\" أو \"لا\"؟\n",1),
            ParentTestModel(7,"هل يحاكي ما يلاحظه احيانا من أفعال يتم أدائها باستخدام أدوات كالتقليب باستخدام ملعقة مثلًا؟\n",1),
            ParentTestModel(8,"هل يحاكي الأفعال المرتبطة بوصف الأشياء؟\n",1),
            ParentTestModel(9,"هل يحاكي الإيماءات أو الإشارات التي عادة ما يستخدمها الشخص القائم بالرعاية؟ \n",1),
            ParentTestModel(10,"هل يحاكي الأنشطة التي تتضمن مزيجا من الاشياء او تتألف من فعلين وشيء واحد؟\n",1),
            ParentTestModel(11,"هل يحاكي الأنشطة التي تتضمن مزيجاً من الأشياء بعد مرور عدة ساعات من ملاحظته لتلك الأنشطة؟\n",1),
            ParentTestModel(12,"تضمين سلسلة من أفعال الأشخاص البالغين المقلدة داخل لعبة تمثيلية يؤديها منفرداً؟\n",1),
            ParentTestModel(13,"محاولة حل المشكلات (بما في ذلك تشغيل اللعب) من خلال محاكاة أفعال الأشخاص البالغين\n",1),
            ParentTestModel(14,"هل يحاكي المواقف والأفعال التي لا تتضمن أدوات مساعدة\n",1),
            ParentTestModel(15,"هل يحاكي سلسلة تتألف من فعلين حركيين غير مترابطين؟\n",1),
            ParentTestModel(16,"هل يقلد لمس أشياء في تسلسل متبعًا نموذج؟\n",1),
            ParentTestModel(17,"هل يقلد سلسلة من الأفعال ويتحول مع النموذج؟\n",1),
            ParentTestModel(18,"هل يقلد تتابع الأنشطة الحركية؟\n",1),
            ParentTestModel(19,"هل يقلد عدد تكرار الحركات؟\n",1),
            ParentTestModel(20,"هل يقلد سلسلة حركية باستخدام أشياء متعددة؟\n",1),
            ParentTestModel(21,"هل يقلد في وقت لاحق؟\n",1)
        )

    }
}